Вопросы и ответы
Глава 5. Дополнительные сведения о типах данных и операциях.

    1. Покажите два способа объявления одномерного массива, состоящего из 12
       элементов типа double.

     1. double x[] = new double[12];
        double[] x = new double[12];

    2. Покажите, как инициализировать одномерный массив целочисленными значениями
       от 1 до 5.

     2. int x[] = {1, 2, 3, 4, 5};

    3. Напишите программу, в которой массив используется для нахождения среднего
       арифметического десяти значений типа double. Используйте любые десять
       чисел.

     3. // Среднее арифметическое 10 значений типа double
        class Avg {
            public static void main(String args[]) {
                double nums[] = {1.1, 2.2, 3.3, 4.4, 5.5, 6.6,
                                  7.7, 8.8, 9.9, 10.1};
                double sum = 0;

                for(int i = 0; i < nums.length; i++)
                  sum += nums[i];

                System.out.println("Среднее значение: " + sum / nums.length);
            }
        }

    4. Измените программу, написанную в упражнении 5.1, таким образом, чтобы
       она сортировала массив символьных строк. Продемонстрируйте её 
       работоспособность.

     4. // Демонстрация пузырьковой сортировки строк
        class StrBubble {
            public static void main(String args[]) {
                String strs[] = {"this", "is", "a", "test",
                                "of", "a", "string", "sort"};

                int a, b;
                String t;
                int size;

                size = strs.length; // количество сортируемых элементов

                // Отобразить исходный массив
                System.out.print("Исходный массив: ");
                for(int i = 0; i < size; i++)
                    System.out.print(" " + strs[i]);
                System.out.println();

                // Пузырьковая сортировка строк
                for(a = 1; a < size; a++)
                    for(b = size - 1; b >= a; b--) {
                        // поменять элементы местами при нарушении
                        // порядка их следования
                        if(strs[b - 1].compareTo(strs[b]) > 0) {
                            t = strs[b - 1];
                            strs[b - 1] = strs[b];
                            strs[b] = t;
                        }
                    }

                // Отобразить отсортированный массив
                System.out.print("Отсортированный массив: ");
                for(int i = 0; i < size; i++)
                    System.out.print(" " + strs[i]);
                System.out.println();
            }
        }

    5. В чем состоит разница междуметодами indexOf() и lastIndexOf() класса
       String?

     5. Метод indexOf() находит первое вхождение указанной подстроки, а метод
        lastIndexOf() - её последнее вхождение в текущей строке.

    6. Все строки являются объектами типа String& Покажите, как вызываются
       методы length() и charAt() для строкового литерала "Мне нравится Java".

     6. Как ни странно, приведенный ниже вызов метода length() вполне допустим.

        System.out.println("Мне нравится Java".length());

        В результате этого вызова на экран выводится значение 17. Аналогичным
        образом вызывается и метод charAt().

    7. Расширьте класс Encode таким образом, чтобы в качестве ключа шифрования
       использовалась строка из восьми символов.

     7. // Улучшенный вариант программы шифрования сообщений
        // с помощью операции поразрядного исключающего ИЛИ
        class EncodeIm {
            public static void main(String args[]) {
                String msg = "This is a test";
                String encmsg = "";
                String decmsg = "";
                String key = "abcdefgp";
                int j;

                System.out.print("Исходное сообщение: ");
                System.out.println(msg);

                // зафишровать сообщение
                j = 0;
                for(int i = 0; i < msg.length(); i++) {
                    encmsg = encmsg + (char) (msg.charAt(i) ^ (key.charAt(j)));
                    j++;
                    if(j == 8) j = 0;
                }

                System.out.print("Зашифрованное сообщение: ");
                System.out.println(encmsg);

                // дешифровать сообщение
                j = 0;
                for(int i = 0; i < msg.length(); i++) {
                    decmsg = decmsg + (char) (encmsg.charAt(i) ^ key.charAt(j));
                    j++;
                    if(j == 8) j = 0;
                }

                System.out.print("Дешифрованное сообщение: ");
                System.out.println(decmsg);
            }
        }

    8. Можно ли применять поразрядные операции к значениям типа double?

     8. Нет, нельзя.

    9. Перепишите приведенную ниже последовательность операторв, воспользовавшись
       оператором ?.

       if(x < 0) y = 10;
       else y = 20;

     9. y = x < 0 ? 10 : 20;

    10. В приведенном ниже фрагменте кода содержится знак &. Какой операции он
        соответствует: поразрядной или логической? Обоснуйте свой ответ.

        boolean a, b;
        // ...
        if(a & b) ...

     10. Это логическая операция, поскольку оба операнда относятся к типу boolean.

    11. Является ли ошибкой превышение верхней границы массива? Является ли
        ошибкой использование отрицательных значений для доступа к элементам
        массива?

     11. Да. Да. Значения массива начинаются с нуля.

    12. Как обозначается операция сдвига вправо без знака?

     12. >>>

    13. Перепишите рассмотренный ранее класс MinMax таким образом, чтобы
        в нем использовалась разновидность for-each цикла for.

     13. // Нахождение минимального и максимального значений в массиве
         class MinMax3 {
             public static void main(String args[]) {
                 int nums[] = new int[10];
                 int min, max;

                 nums[0] = 99;
                 nums[1] = -10;
                 nums[2] = -100123;
                 nums[3] = 18;
                 nums[4] = -987;
                 nums[5] = 5673;
                 nums[6] = 463;
                 nums[7] = -9;
                 nums[8] = 287;
                 nums[9] = 49;

                 min = max = nums[0];
                 for(int v : nums) {
                     if(v < min) min = v;
                     if(v > max) max = v;
                 }
                 System.out.println("min и max: " + min + " " + max);
             }
         }

    14. В упражнении 5.1 была реализована пузырьковая сортировка. Можно ли
        в программе из этого примера заменить обычный цикл for его разновид-
        ностью for-each? Если нельзя, то почему?

     14. Циклы for, выполняющие сортировку в классе Bubble, нельзя преобразовывать
         в вариант for-each. Что касается внешнего цикла, то текущее значение его
         переменной используется во внутреннем цикле. А что касается внутреннего
         цикла, то для перестановки неупорядоченных элементов требуются операции
         присваивания значений элементам массива, что недопустимо в варианте
         for-each.

    15. Можно ли управлять оператором switch c помощью объектов типа String?

     15. Можно, начиная с версии JDK 7.