Вопросы и ответы
Глава 2. Введение в типы данных и операции над ними

    1. Почему в Java строго определены диапазоны допустимых значений и области
       действия простых типов?

     1. Диапазоны допустимых значений и области действия простых типов строго
        определены в Java для того, чтобы обеспечить переносимость программ
        с одной платформы на другую.

    2. Что собой представляет символьный тип в Java и чем он отличается от
       символьного типа в ряде других языков программирования?

     2. Символьный тип задается ключевым словом char. В Java для представления
        символов используется кодировка Unicode, а не ASCII, как во многих
        других языках программирования.

    3. "Переменная типа boolean может иметь любое значение, поскольку любое
       ненулевое значение интерпретируется как истинное". Верно или неверно?

     3. Неверно. Переменная типа boolean может принимать лишь одно из двух
        значений: true или false.

    4. Допустим, результат выполнения программы выглядит следующим образом:

       Один
       Два
       Три
       Напишите строку кода с вызовом метода println(), где этот результат
       выводится в виде одной строки

     4. System.out.println("Один\nДва\nТри");

    5. Какая ошибка допущена в следующем фрагменте кода?
       for(i = 0; i < 10; i++) {
           int sum;
           sum = sum + i;
       }
       System.out.println("Сумма: " + sum);

     5. В этом фрагменте кода имеются две грубые ошибки. Во-первых, переменная sum
        создается на каждом шаге цикла for, а следовательно, в промежутке между по-
        следовательными итерациями предыдущее значение подсчитываемой суммы не будет
        сохранятся в этой переменной. И во-вторых, переменная sum недоступна за
        пределами кодового блока, в котором она объявлена. Поэтому ссылка на нее
        при вызове метода println() недопустима.

    6. Поясните различие между префиксной и постфиксной формами записи операции
       инкремента.

     6. Если оператор инкремента предшествует операнду, исполняющая система
        Java выполнит операцию до извлечения значения операнда и использования
        его в остальной части выражения. Если же оператор инкремента следует за
        операндом, исполняющая система сначала извлечет значение операнда и
        лишь затем инкрементирует сам операнд.

    7. Покажите каким образом укороченная логическая операция И может предотвра-
       тить деление на нуль.

     7. if((b != 0) && (val / b)) ...

    8. До какого типа повышаются типы byte и short при вычислении выражений?

     8. В выражениях типы byte и short повышаются до типа int.

    9. Когда возникает потребность в явном приведении типов?

     9. Явное приведение типов требуется при выполнении преобразований между несо-
        вместимыми типами, а также в случае преобразований, сужающих диапазон
        допустимых значений.

    10. Напишите программу, которая находила бы простые числа в пределах от 2 до 100.

     10. // Нахождение простых чисел в пределах от 2 до 100
         class Prime {
            public static void main(String args[]) {
                int i, j;
                boolean isprime;

                for(i = 2; i < 100; i++) {
                    isprime = true;

                    // проверить, делится ли число без остатка
                    for(j = 2; j <= i/j; j++)
                        // если число делится без остатка, значит, оно не простое
                        if((i % j) == 0) isprime = false;

                    if(isprime)
                        System.out.println(i + " - простое число.");
                }
            }
         }

    11. Оказывают ли избыточные скобки влияние на эффективность выполнения про-
        грамм?

     11. Нет, не оказывают.

    12. Определяет ли блок кода область действия переменных?

     12. Да, определяет.
